#+TITLE: Org-glance: walk in the woods with pleasure
#+AUTHOR: Dmitry Akatov
#+EMAIL: akatovda@yandex.com

#+CATEGORY: org-glance
#+STARTUP: overview

[[https://travis-ci.com/rails-to-cosmos/org-glance][https://travis-ci.com/rails-to-cosmos/org-glance.svg?branch=master]]

https://untools.co

* TODO Proper cache for headlines
* TODO Optimize caches
* TODO Cleanup empty dimensions
* TODO Cache dimension list
* TODO Optimize fetching relations: traverse changelog from end
* PENDING Consistent actions (use same underlying logic as in dimensions)
:LOGBOOK:
- State "PENDING"    from "STARTED"    [2022-11-05 Sat 09:30]
- State "STARTED"    from "TODO"       [2022-11-04 Fri 10:50]
CLOCK: [2022-11-04 Fri 10:50]--[2022-11-05 Sat 09:30] => 22:40
:END:
* PENDING Fix file names
:LOGBOOK:
- State "PENDING"    from "STARTED"    [2022-10-30 Sun 13:06]
- State "STARTED"    from "PENDING"    [2022-10-30 Sun 13:06]
- State "PENDING"    from "STARTED"    [2022-10-30 Sun 13:06]
- State "STARTED"    from "TODO"       [2022-10-30 Sun 12:53]
CLOCK: [2022-10-30 Sun 12:53]--[2022-10-30 Sun 13:06] =>  0:13
:END:
* TODO Fetch and backfill operations should work in background
* TODO Handle encrypted headlines
* TODO Support overview dimensions
* TODO Support read-only dimensions
* TODO Deduplicate classes in wal
* TODO Consistent markers and all the tests [0/4]
** TODO headline indented by user
** TODO org-link inserted
** TODO headline removed
** TODO headline created
* TODO Consider collisions
* TODO Filter world headlines [3/3]
:LOGBOOK:
- State "PENDING"    from "STARTED"    [2022-08-02 Tue 09:30]
- State "STARTED"    from              [2022-08-02 Tue 08:04]
CLOCK: [2022-08-02 Tue 08:04]--[2022-08-02 Tue 09:30] =>  1:26
:END:

** DONE by title (choose headlines interactively)
CLOSED: [2022-08-03 Wed 10:52]
:LOGBOOK:
- State "DONE"       from              [2022-08-03 Wed 10:52]
:END:
** DONE by class (build overviews)
CLOSED: [2022-08-12 Fri 15:07]
:LOGBOOK:
- State "DONE"       from              [2022-08-12 Fri 15:07]
:END:
** DONE by state (build overviews)
CLOSED: [2022-08-12 Fri 15:07]
:LOGBOOK:
- State "DONE"       from              [2022-08-12 Fri 15:07]
:END:
** by active timestamps (build agenda views, interval trees?)
** in-memory lru cache (hash-table)
** by relations (todo)
* https://ftp.gnu.org/old-gnu/Manuals/elisp-manual-21-2.8/html_node/elisp_530.html
* Garbage collector
* TODO Fix highlighting
* TODO Add tests for non-readable world source and dest
* TODO Column filters (by *-p features and timestamps)
* TODO Fulltext search
* TODO Use https://github.com/alphapapa/makem.sh
* TODO Overview [1/5]
** TODO overview of all views registered with view-scoped actions
:LOGBOOK:
- State "STARTED"    from "TODO"       [2021-09-12 Sun 14:06]
CLOCK: [2021-09-12 Sun 14:06]--[2021-09-12 Sun 16:28] =>  2:22
- Clocked out on [2021-09-12 Sun 16:28]
:END:
** TODO commented headlines restrictions
** TODO org-overview-mode: modify-sync headline feature
** DONE org-overview-mode: add headline feature
CLOSED: [2021-08-26 Thu 10:40]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-08-26 Thu 10:40]
:END:
** TODO org-glance:format issue for strings containing % symbol
* Anchor Modeling
- =Article= [[org-glance-visit:Article-20210826-7dc7b39dcaf77d1f25d654967a3a1afd][Anchor Modeling: Peridata between Data and Metadata]]
- =Article= [[org-glance-visit:Article-20210826-9b1d041ca0c9581606151a2ae496115d][Modeling Conflicting, Unreliable, and Varying Information]]
- Implement anchormodeling logbook management (world appearance sets in logbook drawer).
- Reserve posit, ascertains, thing, and class.
- Implement transactions.
- Distinguish data, metadata and peridata (peripheral data, domain classifications).
- Think about how to implement metadata.
- [[https://github.com/Roenbaeck/bareclad][GitHub - Roenbaeck/bareclad: Based on transitional modeling, bareclad is a new type of database that provides features from relational, graph, columnar, and name-value pair databases.]]

Use posits in logbook drawer: [
  {(thing 1, role 1), ..., (thing n, role n)},
  appearing value,
  time of appearance
]

Cache roles: employee/employer, contact/task
* Visualization
** [[https://observablehq.com/@mbostock/tree-of-life][Tree of Life / Mike Bostock / Observable]]
** [[https://observablehq.com/@d3/gallery][Gallery / D3 / Observable]]
- [[http://bl.ocks.org/NPashaP/96447623ef4d342ee09b][DashBoard - bl.ocks.org]]
- [[http://bl.ocks.org/joews/9697914][Animated d3 word cloud - bl.ocks.org]]
- [[http://bl.ocks.org/erkal/9746513][Random Graph Generator - bl.ocks.org]]
- [[http://bl.ocks.org/chaitanyagurrapu/6007521][A Google calendar like display for temporal data using D3.Js - bl.ocks.org]]
- [[http://bl.ocks.org/Jverma/887877fc5c2c2d99be10][Bar chart from external JSON file - bl.ocks.org]]
** [[https://dc-js.github.io/dc.js/][dc.js - Dimensional Charting Javascript Library]]
** [[https://www.data-to-viz.com/graph/edge_bundling.html][Hierarchical edge bundling – from Data to Viz]]
** [[https://bl.ocks.org/vasturiano/ded69192b8269a78d2d97e24211e64e0][Timelines Chart - bl.ocks.org]]
** https://lliquid.github.io/homepage/files/ts13_edgebundle.pdf
* Completing Read [0/1]
** TODO build titles from all direct relations
* Aesthetics
** Gamification
- [[https://en.wikipedia.org/wiki/Colossal_Cave_Adventure][Colossal Cave Adventure - Wikipedia]]
* Thoughts

- [[https://github.com/narendraj9/emlib][emlib: a humble Machine Learning library]]
- https://grishaev.me/clj-zippers-1/
- https://github.com/bbatsov/emacs-lisp-style-guide
- https://ctan.org/pkg/pgfgantt
- https://i.imgur.com/rjmfauQ.png
- https://www.reddit.com/r/emacs/comments/5yhk1m/gantt_charts_for_orgmode/
- http://fastcompression.blogspot.com/p/lz4.html
- https://en.wikipedia.org/wiki/Conflict-free_replicated_data_type
- https://towardsdatascience.com/how-to-build-a-complex-reporting-dashboard-using-dash-and-plotl-4f4257c18a7f#a5c5
- [[http://people.csail.mit.edu/shanir/publications/OPODIS2006-BA.pdf][concurrent skip lists for index implementation]]

** Scope
*** invariants? we can provide invariant on import or persist it in metadata
* dist-packages

- https://github.com/skeeto/emacsql
- https://magit.vc/manual/transient/
- https://altair-viz.github.io/getting_started/overview.html
